Revit 2024 API
BuiltInFailures.FamilyFailures.TryingToAttachWhenJoined Property
 The column and target are joined. The attachment has been removed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TryingToAttachWhenJoined { get; }
Visual Basic
Public Shared ReadOnly Property TryingToAttachWhenJoined As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TryingToAttachWhenJoined {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace